server/app/controllers/pages_controller.rb

  def show
    path = params[:slug]
    @page = Page.find_by_url_slug(path)
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."url_slug" = 'auto_gen_link_url_26' LIMIT 1