server/app/controllers/admin/menu_items_controller.rb

SELECT  "menu_items".* FROM "menu_items"  WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 37]]
---
  def show
    @menu_item = MenuItem.find(params[:id])

INSERT INTO "menu_items" ("created_at", "lft", "name", "path", "rgt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-09-12 19:21:42.595118"], ["lft", 5], ["name", "Services"], ["path", "https://www.owasp.org/index.php/Main_Page"], ["rgt", 6], ["updated_at", "2014-09-12 19:21:42.595118"]]
---
  def create
    menu_item_mapper = MenuItemMapper.new(json_body)

    if menu_item_mapper.save

SELECT  "menu_items".* FROM "menu_items"  WHERE "menu_items"."id" = $1 LIMIT 1 FOR UPDATE  [["id", 35]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 35]]
---
    def destroy
      menu_item = MenuItem.find(params[:id])
      menu_item.destroy