server/app/controllers/admin/pages_controller.rb

  def show
    page = Page.find_by_url_slug(params[:url_slug])
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."url_slug" = 'auto_gen_link_url_22' LIMIT 1

  def create
    page_mapper = PageMapper.new(json_body)

    if page_mapper.save
---
INSERT INTO "pages" ("created_at", "description", "keywords", "title", "type", "updated_at", "url_slug") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    page_mapper = PageMapper.new(json_body, params[:url_slug])

    if page_mapper.save
      redirect_to admin_page_path(page_mapper.page)
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."url_slug" = 'auto_gen_link_url_23' LIMIT 1